hybridMultiphaseFoamV7/tutorials/Darcy_Flow_Cases/Buckley-Leverett/Flow_Driven_VanGenuchten/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (wetting nonWetting);

wetting //alpha=1 wetting alpha1 ("b" if compared to multiphase toolbox)
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1e-6;
    rho             [1 -3 0 0 0 0 0] 1000;   
}

nonWetting //alpha=0 nonwetting alpha2 = 1-alpha1 ("a" in multiphase toolbox)
{
   transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.25e-4; //in unitns of kinematic viscocity
    rho             [1 -3 0 0 0 0 0] 800; 
}

mu1                 [1 -1 -1 0 0 0 0] 1.0e-3;
mu2                 [1 -1 -1 0 0 0 0] 0.1;

//Two Phase Stuff
activateCapillarity     0;

sigma            [1 0 -2 0 0 0 0]  0.077;
k                [0 2 0 0 0 0 0] 1e-11; 

alpha.wettingmin           alpha.wettingmin [0  0  0 0 0 0 0] 0;
alpha.wettingmax           alpha.wettingmax [0  0  0 0 0 0 0] 0.999;

relativePermeabilityModel  VanGenuchten;
capillarityModel           VanGenuchten;

VanGenuchtenCoeffs
{
    alpha.wettingminpc alpha.wettingminpc [0 0 0 0 0 0 0] 0;
    alpha.wettingmaxpc alpha.wettingmaxpc [0 0 0 0 0 0 0] 0.999;
    pc0 pc0 [1 -1 -2 0 0 0 0] 100;
    m 0.5;
}

//Permeability Coefficients

alpha1IrrPerm      [0 0 0 0 0 0 0] 0;

alpha2IrrPerm      [0 0 0 0 0 0 0]  0;

//Capillary Pressure Coefficients

mCap               [0 0 0 0 0 0 0] 0.5;

a                  [0 0 0 0 0 0 0] 0.5;

alpha1IrrPres      [0 0 0 0 0 0 0] 0;

alpha1MaxPres      [0 0 0 0 0 0 0] 1;

PcEntry            [1 -1 -2 0 0 0 0] 100; 
// ************************************************************************* //
