hybridMultiphaseFoamV7/tutorials/Darcy_Flow_Cases/Buckley-Leverett/Flow_Driven_VanGenuchten/system/setFieldsDict2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

regions
(


   boxToCell
    {
        box (-1e-6 0.047 -1e-6) (0.0458 0.05 0.00151);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }


    
    boxToCell
    {
        box (-1e-6 -1e-6 -1e-6) (0.001 0.046 0.00151);
        fieldValues
        (
            volScalarFieldValue epss 0.5
        );
    }

     boxToCell
    {
        box (0.0448 -1e-6 -1e-6) (0.0458 0.046 0.00151);
        fieldValues
        (
            volScalarFieldValue epss 0.5
        );
    }

boxToCell
    {
        box (-1e-6 0.044 -1e-6) (0.0458 0.046 0.00151);
        fieldValues
        (
            volScalarFieldValue epss 0.3
        );
    }

);


// ************************************************************************* //
